In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[('de_project',),
 ('dt_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('uber',),
 ('world',),
 ('zomato',)]

In [4]:
%%sql
use world;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [5]:
%%sql
##WINDOW FUNCTION
CREATE TABLE Sales (
    TransactionID INT,
    Store VARCHAR(50),
    SalesAmount DECIMAL(10, 2)
);

INSERT INTO Sales (TransactionID, Store, SalesAmount)
VALUES
    (1, 'A', 100.00),
    (2, 'A', 200.00),
    (3, 'A', 150.00),
    (4, 'B', 250.00),
    (5, 'B', 300.00);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
5 rows affected.

[]

In [11]:
%%sql
SELECT TransactionID, Store, SalesAmount,
       SUM(SalesAmount) OVER ( PARTITION BY Store order by TransactionID asc  ) AS TotalSales
FROM Sales;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('100.00')),
 (2, 'A', Decimal('200.00'), Decimal('300.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('250.00')),
 (5, 'B', Decimal('300.00'), Decimal('550.00'))]

In [15]:
%%sql
use world;
CREATE TABLE Employees (
    EmployeeID INT,
    Name VARCHAR(100),
    Department VARCHAR(50),
    HireDate DATE
);


INSERT INTO Employees (EmployeeID, Name, Department, HireDate)
VALUES
    (1, 'Alice', 'HR', '2020-05-01'),
    (1, 'Alice', 'HR', '2022-06-15'),
    (2, 'Bob', 'IT', '2021-07-10'),
    (3, 'Charlie', 'Finance', '2020-09-30'),
    (3, 'Charlie', 'Finance', '2022-05-22');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'employees' already exists
[SQL: CREATE TABLE Employees (
    EmployeeID INT,
    Name VARCHAR(100),
    Department VARCHAR(50),
    HireDate DATE
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [14]:
%%sql
##ROW_NUMBER
select * from Employees

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (1, 'Alice', 'HR', datetime.date(2022, 6, 15)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30)),
 (3, 'Charlie', 'Finance', datetime.date(2022, 5, 22))]

In [23]:
%%sql
#NOW WE ARE GOING TO GET UNIQUE NAME
with cte as  (
select EmployeeID,Name,Department,HireDate,
ROW_NUMBER() OVER (PARTITION BY EmployeeID ORDER BY HireDate asc) as rownum
from Employees) 

select EmployeeID,Name,Department,HireDate from cte  where rownum=1

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30))]